#METOD WHITH IS
# ALIREZA HEYRAN


#isalpha #چک میکند که تمام کاراکترهای رشته حروف باشند
#txt = "HELLO"
#txt.isalpha()
# True

#--------------------------------------------------------------------------

#isalnum #چک میکند که تمام کاراکترهای رشته ترکیب عدد و حروف باشند
#txt = "hello44"
#txt.isalnum()
# True

#txt = "hello 44"
#txt.isalnum()
# False

#---------------------------------------------------------------------------

#isdigit #چک میکند که تمام کاراکترهای رشته عدد باشند
#a = "50800"
#b = "50800a"
#a.isdigit() #True
#b.isdigit() #False

#-----------------------------------------------------------------------------

#islower #چک میکند که تمام حروف رشته کوچک باشند
#a = "Hello world"
#b = "hello 123"

#a.islower() # False
#b.islower() # True

#------------------------------------------------------------------------------

#isprintable #چک میکند که تمام حروف رشته قایل پرینت باشند
#txt = "Hello\nAre you #1?"
#txt.isprintable()
# False

#------------------------------------------------------------------------------

#isspace #چک میکند که تمام کاراکترهای رشته فاصله باشند
#a = "   s   "
#b = "       "

#a.isspace() # False
#b.isspace() # True

#--------------------------------------------------------------------------------

#isupper #چک میکند که تمام حروف رشته بزرگ باشند
#txt = "HELLO"
#txt.isupper()
# True
 
#---------------------------------------------------------------------------------