#METHOD WITHOUT IS
# ALIREZA HEYRAN 

#capitalize #اولین کرکتر رشته را بزرگ میکند
#txt = 'hello hello'
#txt.capitalize()
# HELLO hello

#-----------------------------------------------------------------

#center #طول رشته را زیاد کرده و آن را در وسط قرار میدهد
#txt = "hello"
#txt.center(11)
#    hello
#txt = "hello"
#txt.center(11 , '<')
# <<<hello<<<

#------------------------------------------------------------------

#count #تعداد دفعاتی که یک مقدار در یک رشته تکرار شده است را برمیگرداند
#txt = "afhelloagaghellogmbaghelloqrqt"
#txt.count("hello")
# 3

#-------------------------------------------------------------------

#endswith #چک میکند که آیا یک رشته با کاراکتر خاصی تمام میشود یا خیر 
#txt = "Hello"
#txt.endswith("o")
# True

#--------------------------------------------------------------------

#find #چک میکند که آیا یک مقدار در یک رشته وجود دارد یا خیر
#txt = "afmdaofmhellosvm"
#txt.find("hello")
# 8

#---------------------------------------------------------------------

#lower #یک رشته را به حروف کوچک تبدیل میکند
#txt = "Hello"
#txt.lower()
# hello
#----------------------------------------------------------------------

#format #یک متغیر را در یک رشته جایگذاری میکند
#txt = "hello my name is {mohammad}"
#txt.format(mohammad = "alireza")
#hello my name is alireza

#----------------------------------------------------------------------

#index #چک میکند که آیا یک مقدار در یک رشته وجود دارد یه خیر
#اگر وجود داشته باشد ایندکس آنرا برمیگرداند اگرنه ارور خواهد داد

#txt = "afmdaofmhellosvm"
#txt.index("hello")
# 8


#txt = "afmdaofmsvm"
#txt.find("hello")
# -1

#------------------------------------------------------------------------

#replace # یک مقدار را با یک مقدار دیگر جایگزین میکند
#txt = "hello"
#txt.replace("hello", "bye")
# bye

#-------------------------------------------------------------------------

#startswith #چک میکند که آیا یک رشته با کاراکتر خاصی شروع میشود یا خیر
#txt = "Hello, bye"
#txt.startswith("Hello")
# True

#--------------------------------------------------------------------------

#strip #فاصله‌های خالی را از یک رشته حذف میکند
#txt = "     hello     "
#txt.strip()
# hello
 
#---------------------------------------------------------------------------

#swapcase #کاراکترهای کوچک را به بزرگ و کاراکترهای بزرگ را به کوچک تبدیل میکند
#txt = "HEllo"
#txt.swapcase()
# heLLO

#-----------------------------------------------------------------------------

#upper #تبدیل کاراکترهای کوچک به بزرگ
#txt = "hello"
#txt.upper()
# HELLO
